"""
Две вершины в графе связаны, если существует соединяющая их (элементарная) цепь.

Компонента связности  — такое подмножество вершин графа,
для любых двух вершин которого существует путь из одной в другую,
и не существует пути из вершины этого подмножества в вершину не из этого подмножества.

Сильная связность. Две вершины в ориентированном графе сильно связаны,
если существует путь из первой во вторую и из второй в первую.

Слабая связность. Две вершины в ориентированном графе слабо связаны,
если существует только путь из первой во вторую или из второй в первую.
"""